; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	image5 - mode
	spectrograph3 - mode
	infrared0 - mode
	spectrograph4 - mode
	infrared2 - mode
	infrared1 - mode
	Star1 - direction
	GroundStation2 - direction
	GroundStation5 - direction
	Star0 - direction
	Star4 - direction
	Star3 - direction
	Phenomenon6 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Star9 - direction
	Planet10 - direction
)
(:init
	(supports instrument0 image5)
	(supports instrument0 infrared0)
	(calibration_target instrument0 Star0)
	(calibration_target instrument0 Star4)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star0)
	(supports instrument1 spectrograph3)
	(supports instrument1 infrared1)
	(supports instrument1 infrared2)
	(supports instrument1 spectrograph4)
	(calibration_target instrument1 Star3)
	(calibration_target instrument1 Star4)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation5)
)
(:goal (and
	(pointing satellite0 Phenomenon7)
	(have_image Phenomenon6 spectrograph4)
	(have_image Phenomenon6 spectrograph3)
	(have_image Phenomenon7 infrared1)
	(have_image Planet8 spectrograph4)
	(have_image Planet8 infrared0)
	(have_image Star9 spectrograph4)
	(have_image Planet10 spectrograph3)
))

)

; plan
1. (turn_to satellite1 star3 groundstation5)
   deleted: (pointing satellite1 groundstation5)
   added: (pointing satellite1 star3)
   goals met: 0 of 8
2. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 8
3. (calibrate satellite1 instrument1 star3)
   added: (calibrated instrument1)
   goals met: 0 of 8
4. (turn_to satellite1 planet10 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 planet10)
   goals met: 0 of 8
5. (take_image satellite1 planet10 instrument1 spectrograph3)
   added: (have_image planet10 spectrograph3)
   goals met: 1 of 8
6. (turn_to satellite1 phenomenon7 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 phenomenon7)
   goals met: 1 of 8
7. (take_image satellite1 phenomenon7 instrument1 infrared1)
   added: (have_image phenomenon7 infrared1)
   goals met: 2 of 8
8. (turn_to satellite1 phenomenon6 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 phenomenon6)
   goals met: 2 of 8
9. (take_image satellite1 phenomenon6 instrument1 spectrograph3)
   added: (have_image phenomenon6 spectrograph3)
   goals met: 3 of 8
10. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 3 of 8
11. (calibrate satellite0 instrument0 star0)
   added: (calibrated instrument0)
   goals met: 3 of 8
12. (take_image satellite1 phenomenon6 instrument1 spectrograph4)
   added: (have_image phenomenon6 spectrograph4)
   goals met: 4 of 8
13. (turn_to satellite0 planet8 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 planet8)
   goals met: 4 of 8
14. (take_image satellite0 planet8 instrument0 infrared0)
   added: (have_image planet8 infrared0)
   goals met: 5 of 8
15. (turn_to satellite0 phenomenon7 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 phenomenon7)
   goals met: 6 of 8
16. (turn_to satellite1 planet8 phenomenon6)
   deleted: (pointing satellite1 phenomenon6)
   added: (pointing satellite1 planet8)
   goals met: 6 of 8
17. (take_image satellite1 planet8 instrument1 spectrograph4)
   added: (have_image planet8 spectrograph4)
   goals met: 7 of 8
18. (turn_to satellite1 star9 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 star9)
   goals met: 7 of 8
19. (take_image satellite1 star9 instrument1 spectrograph4)
   added: (have_image star9 spectrograph4)
   goals met: 8 of 8
